analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32655/Include/max32655.svd
    <register>
     <name>RXCTRL0</name>
     <description>Receive Control Register 0.</description>
     <addressOffset>0x1C</addressOffset>
     <fields>
      <field>
       <name>DNR</name>
       <description>Do Not Respond.</description>
       <bitRange>[0:0]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>respond</name>
         <description>Always respond to address match.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>not_respond_rx_fifo_empty</name>
         <description>Do not respond to address match when RX_FIFO is not empty.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>FLUSH</name>
       <description>Receive FIFO Flush. This bit is automatically cleared to 0 after the operation. Setting this bit to 1 will affect RX_FIFO status.</description>
       <bitRange>[7:7]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>not_flushed</name>
         <description>FIFO not flushed.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>flush</name>
         <description>Flush RX_FIFO.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>THD_LVL</name>
       <description>Receive FIFO Threshold. These bits define the RX_FIFO interrupt threshold.</description>
       <bitRange>[11:8]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>RXCTRL1</name>
     <description>Receive Control Register 1.</description>
     <addressOffset>0x20</addressOffset>
     <fields>
      <field>
       <name>CNT</name>
       <description>Receive Count Bits. These bits define the number of bytes to be received in a transaction, except for the case RXCNT = 0. RXCNT = 0 means 256 bytes to be received in a transaction.</description>
       <bitRange>[7:0]</bitRange>
      </field>
      <field>
       <name>LVL</name>
       <description>Receive FIFO Count. These bits reflect the number of byte in the RX_FIFO. These bits are flushed when I2CEN = 0.</description>
       <bitRange>[11:8]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>TXCTRL0</name>
     <description>Transmit Control Register 0.</description>
     <addressOffset>0x24</addressOffset>
     <fields>
      <field>
       <name>PRELOAD_MODE</name>
       <description>Transmit FIFO Preaload Mode. Setting this bit will allow for high speed application to preload the transmit FIFO prior to Slave Address Match.</description>
       <bitRange>[0:0]</bitRange>
      </field>
      <field>
       <name>TX_READY_MODE</name>
       <description>Transmit FIFO Ready Manual Mode.</description>
       <bitRange>[1:1]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>HW control of I2CTXRDY enabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>HW control of I2CTXRDY disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>GC_ADDR_FLUSH_DIS</name>
       <description>TX FIFO General Call Address Match Auto Flush Disable.</description>
       <bitRange>[2:2]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Enabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>WR_ADDR_FLUSH_DIS</name>
       <description>TX FIFO Slave Address Match Write Auto Flush Disable.</description>
       <bitRange>[3:3]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Enabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RD_ADDR_FLUSH_DIS</name>
       <description>TX FIFO Slave Address Match Read Auto Flush Disable.</description>
       <bitRange>[4:4]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Enabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>NACK_FLUSH_DIS</name>
       <description>TX FIFO received NACK Auto Flush Disable.</description>
       <bitRange>[5:5]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Enabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>FLUSH</name>
       <description>Transmit FIFO Flush. This bit is automatically cleared to 0 after the operation.</description>
       <bitRange>[7:7]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>not_flushed</name>
         <description>FIFO not flushed.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>flush</name>
         <description>Flush TX_FIFO.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>THD_VAL</name>
       <description>Transmit FIFO Threshold. These bits define the TX_FIFO interrupt threshold.</description>
       <bitRange>[11:8]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TXCTRL1</name>
     <description>Transmit Control Register 1.</description>
     <addressOffset>0x28</addressOffset>
     <fields>
      <field>
       <name>PRELOAD_RDY</name>
       <description>Transmit FIFO Preload Ready.</description>
       <bitRange>[0:0]</bitRange>
      </field>
      <field>
       <name>LVL</name>
       <description>Transmit FIFO Count. These bits reflect the number of bytes in the TX_FIFO.</description>
       <bitRange>[11:8]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO</name>
     <description>Data Register.</description>
     <addressOffset>0x2C</addressOffset>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data is read from or written to this location. Transmit and receive FIFO are separate but both are addressed at this location.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MSTCTRL</name>
     <description>Master Control Register.</description>
     <addressOffset>0x30</addressOffset>
     <fields>
      <field>
       <name>START</name>
       <description>Setting this bit to 1 will start a master transfer.</description>
       <bitRange>[0:0]</bitRange>
      </field>
      <field>
       <name>RESTART</name>
       <description>Setting this bit to 1 will generate a repeated START.</description>
       <bitRange>[1:1]</bitRange>
      </field>
      <field>
       <name>STOP</name>
       <description>Setting this bit to 1 will generate a STOP condition.</description>
       <bitRange>[2:2]</bitRange>
      </field>
      <field>
       <name>EX_ADDR_EN</name>
       <description>Slave Extend Address Select.</description>
       <bitRange>[7:7]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>7_bits_address</name>
         <description>7-bit address.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>10_bits_address</name>
         <description>10-bit address.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>CLKLO</name>
     <description>Clock Low Register.</description>
     <addressOffset>0x34</addressOffset>
     <fields>
      <field>
       <name>LO</name>
       <description>Clock low. In master mode, these bits define the SCL low period. In slave mode, these bits define the time SCL will be held low after data is outputted.</description>
       <bitRange>[8:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CLKHI</name>
     <description>Clock high Register.</description>
     <addressOffset>0x38</addressOffset>
     <fields>
      <field>
       <name>HI</name>
       <description>Clock High. In master mode, these bits define the SCL high period.</description>
       <bitRange>[8:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>HSCLK</name>
     <description>Clock high Register.</description>
     <addressOffset>0x3C</addressOffset>
     <fields>
      <field>
       <name>LO</name>
       <description>Clock Low. This field sets the Hs-Mode clock low count. In Slave mode, this is the time SCL is held low after data is output on SDA.</description>
       <bitRange>[7:0]</bitRange>
      </field>
      <field>
       <name>HI</name>
       <description>Clock High. This field sets the Hs-Mode clock high count. In Slave mode, this is the time SCL is held high after data is output on SDA</description>
       <bitRange>[15:8]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TIMEOUT</name>
     <description>Timeout Register</description>
     <addressOffset>0x40</addressOffset>
     <fields>
      <field>
       <name>SCL_TO_VAL</name>
       <description>Timeout</description>
       <bitRange>[15:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>DMA</name>
     <description>DMA Register.</description>
     <addressOffset>0x48</addressOffset>
     <fields>
      <field>
       <name>TX_EN</name>
       <description>TX channel enable.</description>
       <bitRange>[0:0]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RX_EN</name>
       <description>RX channel enable.</description>
       <bitRange>[1:1]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>4</dimIncrement>
     <name>SLAVE_MULTI[%s]</name>
     <description>Slave Address Register.</description>
     <alternateRegister>SLAVE0</alternateRegister>
     <addressOffset>0x4C</addressOffset>
     <size>32</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>ADDR</name>
       <description>Slave Address.</description>
       <bitRange>[9:0]</bitRange>
      </field>
      <field>
       <name>DIS</name>
       <description>Slave Disable.</description>
       <bitRange>[10:10]</bitRange>
      </field>
      <field>
       <name>EXT_ADDR_EN</name>
       <description>Extended Address Select.</description>
       <bitRange>[15:15]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>7_bits_address</name>
         <description>7-bit address.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>10_bits_address</name>
         <description>10-bit address.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>SLAVE0</name>
     <description>Slave Address Register.</description>
     <addressOffset>0x4C</addressOffset>
    </register>
    <register>
     <name>SLAVE1</name>
     <description>Slave Address Register.</description>
     <addressOffset>0x50</addressOffset>
    </register>
    <register>
     <name>SLAVE2</name>
     <description>Slave Address Register.</description>
     <addressOffset>0x54</addressOffset>
    </register>
    <register>
     <name>SLAVE3</name>
     <description>Slave Address Register.</description>
     <addressOffset>0x58</addressOffset>
    </register>
