analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32655/Include/max32655.svd
   </registers>
  </peripheral>
<!--PT Pulse Train-->
  <peripheral derivedFrom="PT">
   <name>PT1</name>
   <description>Pulse Train 1</description>
   <baseAddress>0x4003C030</baseAddress>
  </peripheral>
<!--PT1 Pulse Train 1-->
  <peripheral derivedFrom="PT">
   <name>PT2</name>
   <description>Pulse Train 2</description>
   <baseAddress>0x4003C040</baseAddress>
  </peripheral>
<!--PT2 Pulse Train 2-->
  <peripheral derivedFrom="PT">
   <name>PT3</name>
   <description>Pulse Train 3</description>
   <baseAddress>0x4003C050</baseAddress>
  </peripheral>
<!--PT3 Pulse Train 3-->
  <peripheral>
   <name>PTG</name>
   <description>Pulse Train Generation</description>
   <groupName>Pulse_Train</groupName>
   <baseAddress>0x4003C000</baseAddress>
   <size>32</size>
   <access>read-write</access>
   <addressBlock>
    <offset>0</offset>
    <size>0x0018</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>PT</name>
    <description>Pulse Train IRQ</description>
    <value>59</value>
   </interrupt>
   <registers>
    <register>
     <name>ENABLE</name>
     <description>Global Enable/Disable Controls for All Pulse Trains</description>
     <addressOffset>0x0000</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>pt0</name>
       <description>Enable/Disable control for PT0</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt1</name>
       <description>Enable/Disable control for PT1</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt2</name>
       <description>Enable/Disable control for PT2</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt3</name>
       <description>Enable/Disable control for PT3</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>RESYNC</name>
     <description>Global Resync (All Pulse Trains) Control</description>
     <addressOffset>0x0004</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>pt0</name>
       <description>Resync control for PT0</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt1</name>
       <description>Resync control for PT1</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt2</name>
       <description>Resync control for PT2</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt3</name>
       <description>Resync control for PT3</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>STOP_INTFL</name>
     <description>Pulse Train Stop Interrupt Flags</description>
     <addressOffset>0x0008</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>pt0</name>
       <description>Pulse Train 0 Stopped Interrupt Flag</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt1</name>
       <description>Pulse Train 1 Stopped Interrupt Flag</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt2</name>
       <description>Pulse Train 2 Stopped Interrupt Flag</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt3</name>
       <description>Pulse Train 3 Stopped Interrupt Flag</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>STOP_INTEN</name>
     <description>Pulse Train Stop Interrupt Enable/Disable</description>
     <addressOffset>0x000C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>pt0</name>
       <description>Pulse Train 0 Stopped Interrupt Enable/Disable</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt1</name>
       <description>Pulse Train 1 Stopped Interrupt Enable/Disable</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt2</name>
       <description>Pulse Train 2 Stopped Interrupt Enable/Disable</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt3</name>
       <description>Pulse Train 3 Stopped Interrupt Enable/Disable</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SAFE_EN</name>
     <description>Pulse Train Global Safe Enable.</description>
     <addressOffset>0x0010</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>PT0</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT1</name>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT2</name>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT3</name>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SAFE_DIS</name>
     <description>Pulse Train Global Safe Disable.</description>
     <addressOffset>0x0014</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>PT0</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT1</name>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT2</name>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT3</name>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>READY_INTFL</name>
     <description>Pulse Train Ready Interrupt Flags</description>
     <addressOffset>0x0018</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>pt0</name>
       <description>Pulse Train 0 Ready Interrupt Flag</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt1</name>
       <description>Pulse Train 1 Ready Interrupt Flag</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt2</name>
       <description>Pulse Train 2 Ready Interrupt Flag</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt3</name>
       <description>Pulse Train 3 Ready Interrupt Flag</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>READY_INTEN</name>
     <description>Pulse Train Ready Interrupt Enable/Disable</description>
     <addressOffset>0x001C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>pt0</name>
       <description>Pulse Train 0 Ready Interrupt Enable/Disable</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt1</name>
       <description>Pulse Train 1 Ready Interrupt Enable/Disable</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt2</name>
       <description>Pulse Train 2 Ready Interrupt Enable/Disable</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt3</name>
       <description>Pulse Train 3 Ready Interrupt Enable/Disable</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
