analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32655/Include/max32655.svd
   </registers>
  </peripheral>
<!--TMR Low-Power Configurable Timer-->
  <peripheral derivedFrom="TMR">
   <name>TMR1</name>
   <description>Low-Power Configurable Timer 1</description>
   <baseAddress>0x40011000</baseAddress>
   <interrupt>
    <name>TMR1</name>
    <description>TMR1 IRQ</description>
    <value>6</value>
   </interrupt>
  </peripheral>
<!--TMR1 Low-Power Configurable Timer 1-->
  <peripheral derivedFrom="TMR">
   <name>TMR2</name>
   <description>Low-Power Configurable Timer 2</description>
   <baseAddress>0x40012000</baseAddress>
   <interrupt>
    <name>TMR2</name>
    <description>TMR2 IRQ</description>
    <value>7</value>
   </interrupt>
  </peripheral>
<!--TMR2 Low-Power Configurable Timer 2-->
  <peripheral derivedFrom="TMR">
   <name>TMR3</name>
   <description>Low-Power Configurable Timer 3</description>
   <baseAddress>0x40013000</baseAddress>
   <interrupt>
    <name>TMR3</name>
    <description>TMR3 IRQ</description>
    <value>8</value>
   </interrupt>
  </peripheral>
<!--TMR3 Low-Power Configurable Timer 3-->
  <peripheral derivedFrom="TMR">
   <name>TMR4</name>
   <description>Low-Power Configurable Timer 4</description>
   <baseAddress>0x40080C00</baseAddress>
   <interrupt>
    <name>TMR4</name>
    <description>TMR4 IRQ</description>
    <value>9</value>
   </interrupt>
  </peripheral>
<!--TMR4 Low-Power Configurable Timer 4-->
  <peripheral derivedFrom="TMR">
   <name>TMR5</name>
   <description>Low-Power Configurable Timer 5</description>
   <baseAddress>0x40081000</baseAddress>
   <interrupt>
    <name>TMR5</name>
    <description>TMR5 IRQ</description>
    <value>10</value>
   </interrupt>
  </peripheral>
<!--TMR5 Low-Power Configurable Timer 5-->
  <peripheral>
   <name>TRIMSIR</name>
   <description>Trim System Initilazation Registers</description>
   <baseAddress>0x40005400</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>RTC</name>
     <description>RTC Trim System Initialization Register.</description>
     <addressOffset>0x08</addressOffset>
     <fields>
      <field>
       <name>X1TRIM</name>
       <description>RTC X1 Trim.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
      <field>
       <name>X2TRIM</name>
       <description>RTC X2 Trim.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
      <field>
       <name>LOCK</name>
       <description>Lock.</description>
       <bitOffset>31</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SIMO</name>
     <description>SIMO Trim System Initialization Register.</description>
     <addressOffset>0x34</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>CLKDIV</name>
       <description>SIMO Clock Divide.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>3</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>DIV1</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DIV16</name>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DIV32</name>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DIV64</name>
         <value>5</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DIV128</name>
         <value>7</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>IPOLO</name>
     <description>IPO Low Trim System Initialization Register.</description>
     <addressOffset>0x3C</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>IPO_LIMITLO</name>
       <description>IPO Low Limit Trim.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CTRL</name>
     <description>Control Trim System Initialization Register.</description>
     <addressOffset>0x40</addressOffset>
     <fields>
      <field>
       <name>VDDA_LIMITLO</name>
       <description>VDDA Low Trim Limit.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>VDDA_LIMITHI</name>
       <description>VDDA High Trim Limit.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>IPO_LIMITHI</name>
       <description>IPO High Trim Limit.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>9</bitWidth>
      </field>
      <field>
       <name>INRO_SEL</name>
       <description>INRO Clock Select.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>8KHZ</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>16KHZ</name>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>30KHZ</name>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>INRO_TRIM</name>
       <description>INRO Clock Trim.</description>
       <bitOffset>29</bitOffset>
       <bitWidth>3</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>INRO</name>
     <description>RTC Trim System Initialization Register.</description>
     <addressOffset>0x44</addressOffset>
     <fields>
      <field>
       <name>TRIM16K</name>
       <description>INRO 16KHz Trim.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>3</bitWidth>
      </field>
      <field>
       <name>TRIM30K</name>
       <description>INRO 30KHz Trim.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>3</bitWidth>
      </field>
      <field>
       <name>LPCLKSEL</name>
       <description>INRO Low Power Mode Clock Select.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>8KHZ</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>16KHZ</name>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>30KHZ</name>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
